sommer78/HeartRate/Bee1_SDK_1.1.11894.12638/RTL8762/Source/PeripheralSample/hfc100.c

// FIT FOR MP3 V4 BOARD SHAPE----- fit for HFC-100-A-X18-mainboard.sch   
#include <avr/interrupt.h>   
#include <avr/signal.h>   
#include <avr/sleep.h>   
#include <avr/pgmspace.h>   
//#include <avr/eeprom.h>   
#include <avr/io.h>   
#include <avr/iom16.h>   
   
#define     voice_1             0   
#define     voice_2             1   
#define     voice_3             2   
#define     voice_4             3   
#define     voice_5             4   
#define     voice_6             5   
#define     voice_7             6   
#define     voice_8             7   
#define     voice_9             8   
#define     voice_10            9   
#define     voice_11            10   
#define     voice_12            11   
#define     voice_13            12   
#define     voice_14            13   
#define     voice_15            14   
#define     voice_16            15   
#define     voice_17            16   
#define     voice_18            17   
#define     voice_19            18   
#define     voice_20            19   
#define     voice_30            20   
#define     voice_40            21   
#define     voice_50            22   
#define     voice_60            23   
#define     voice_70            24   
#define     voice_80            25   
#define     voice_90            26   
#define     voice_100           27   
#define     voice_200           28   
#define     voice_seconds       29   
#define     voice_minute        30   
#define     voice_minutes       31   
#define     voice_time_period   32   
#define     voice_heart_rate    33   
#define     voice_hello         34   
#define     voice_goodbye       35   
#define     voice_space         36   
   
   
#define     on                  1   
#define     off                 0   
#define     yes                 1   
#define     no                  0   
#define     end                 0   
#define     start               1   
#define     ADCSRA_INIT         0x03        // ADC enable, clear IF, use CK/8 as clock source   
#define     AD_Heart_rate_wave  0x40        // AD channels selection: select ADC0; ref to AVCC; ADdata right adjust! device.   
#define     default_interval_times  4       // 20 seconds interval   
   
static uint8_t eep_heart_rate_high          __attribute__((section(".eeprom")));   
static uint8_t eep_heart_rate_low           __attribute__((section(".eeprom")));   
static uint8_t eep_interval_times           __attribute__((section(".eeprom")));   
static uint8_t eep_x_seconds                __attribute__((section(".eeprom")));   
   
unsigned char   i,temp00,temp11,temp22,temp33,system_set=1;   
unsigned char   up=0,down=0,direction=0,mode=0xf0,power_off_counter=0;      // variable defination   
unsigned char   filter_times=0;   
unsigned char   x_seconds_test=end,power_supply;   
unsigned char   power_down=off,temp3,stable_counter=0;   
unsigned char   power_on_off=off;   
unsigned char   heart_rate_high,heart_rate_low; // for example heart_rate==250, heart_rate_high=200,heart_rate_low=50   
   
unsigned int    heart_rate=0,heart_rate_ref=0x03ff;   
unsigned int    ad_temp=0xff,sample_number=0,counter=0;    
unsigned int    max=0x03ff,min=0x0000,overflow_times=0,interval_times=400;   
unsigned int    counter_before=0,counter_after=0;   
unsigned int    x_seconds_counter=0,x_seconds=200;   
unsigned int    key_up=0,key_down=0,key_instant=0;   
unsigned int    sample_result_before,sample_result_after;   
   
typedef struct    
{    
   unsigned char bit0 : 1,    
                 bit1 : 1,    
                 bit2 : 1,    
                 bit3 : 1,    
                 bit4 : 1,    
                 bit5 : 1,    
                 bit6 : 1,    
                 bit7 : 1;    
} bit_field;    
// Define macro to get the value of each bit    
#define GET_BIT(port) (*(volatile bit_field *) (_SFR_ADDR(port)))    
   
// Define functions for each bit of the I/O ports in the program    
   
//PORTA DEFINE                                               DDRX      PORTX   
#define     AD              GET_BIT(PINA).bit0      //INPUT  I/O  0         1   
//                                                                0         1   
//                                                                0         1   
#define     IR_EMITER       GET_BIT(PORTA).bit3     //OUTPUT I/O  1         0   
#define     LED1            GET_BIT(PORTA).bit4     //            1         1   
#define     SHUTDOWN        GET_BIT(PORTA).bit5     //            1         0   
#define     SBT             GET_BIT(PORTA).bit6     //            1         1   
#define     STAT            GET_BIT(PINA).bit7      //INPUT I/O   0         1   
   
//PORTB DEFINE    
#define     VOL_up          GET_BIT(PINB).bit0      //INPUT  I/O  0         1   
#define     VOL_down        GET_BIT(PINB).bit1      //INPUT I/O   0         1   
#define     INSTANT         GET_BIT(PINB).bit2      //INPUT I/O   0         1   
#define     U_D             GET_BIT(PORTB).bit3     //OUTPUT I/O  1         1   
#define     CS              GET_BIT(PORTB).bit4     //            1         1   
#define     OUT2            GET_BIT(PINB).bit5      //INPUT I/O   0         1   
#define     OUT1            GET_BIT(PINB).bit6      //INPUT I/O   0         1   
#define     OUT3            GET_BIT(PINB).bit7      //            0         1   
   
//PORTC DEFINE    
#define     SCL             GET_BIT(PORTC).bit0     //OUTPUT I/O  1         1   
#define     SDA             GET_BIT(PORTC).bit1     //OUTPUT I/O  1         1   
#define     M1              GET_BIT(PORTC).bit2     //            1         0   
#define     M0              GET_BIT(PORTC).bit3     //OUTPUT I/O  1         1   
#define     POWER_CTRL      GET_BIT(PORTC).bit4     //            1         0   
   
   
//PORTD DEFINE    
#define     S1              GET_BIT(PORTD).bit0     //OUTPUT I/O  1         0   
#define     S2              GET_BIT(PORTD).bit1     //OUTPUT I/O  1         1   
#define     S3              GET_BIT(PORTD).bit2     //OUTPUT I/O  1         1   
#define     S4              GET_BIT(PORTD).bit3     //OUTPUT I/O  1         1   
#define     S5              GET_BIT(PORTD).bit4     //OUTPUT I/O  1         1   
#define     S6              GET_BIT(PORTD).bit5     //OUTPUT I/O  1         1   
#define     S7              GET_BIT(PORTD).bit6     //OUTPUT I/O  1         1   
#define     S8              GET_BIT(PORTD).bit7     //OUTPUT I/O  1         1   
   
//--------------------------------------------------------------------------------------------------------------//   
void  delay_1ms(void)               //delay_1ms function   
    {      
        unsigned int i;   
        for(i=0;i<47;i++)   
        ;   
    }   
void  delay(unsigned int number)    //delay function                   
    {   
        unsigned int i=0;   
        while(i<number)   
        {      
            delay_1ms();   
            i++;   
        }      
    }   
//--------------------------------------------------------------------------------------------------------------//   
void    voice(unsigned char address)   
    {   
        SBT=0;                              // ensure that SBT was clear before lock the address of voice   
        //PORTC=address;   
        if(address&0x80)   
        {   
            S8=1;   
        }   
        else   
        {   
            S8=0;   
        }          
        if(address&0x40)   
        {   
            S7=1;   
        }   
        else   
        {   
            S7=0;   
        }   
        if(address&0x20)   
        {   
            S6=1;   
        }   
        else   
        {   
            S6=0;   
        }   
        if(address&0x10)   
        {   
            S5=1;   
        }   
        else   
        {   
            S5=0;   
        }   
        if(address&0x08)   
        {   
            S4=1;   
        }   
        else   
        {   
            S4=0;   
        }   
        if(address&0x04)   
        {   
            S3=1;   
        }   
        else   
        {   
            S3=0;   
        }   
        if(address&0x02)   
        {   
            S2=1;   
        }   
        else   
        {   
            S2=0;   
        }   
        if(address&0x01)   
        {   
            S1=1;   
        }   
        else   
        {   
            S1=0;   
        }          
        SBT=1;   
        while(OUT3 == 0);   
        while(OUT3 == 1)   
        {   
            x_seconds_counter=0;            //empty   
            power_off_counter=0;   
        }   
        SBT=0;   
    }   
//--------------------------------------------------------------------------------------------------------------//   
void    port_init(void)   
    {          
        DDRA=0b01111000;                    //initial PORT A   
        PORTA=0b11010111;   
        DDRB=0b00011000;                    //initial PORT B   
        PORTB=0b11111111;   
        DDRC=0b00011111;                    //initial PORT C   
        PORTC=0b11101011;   
        DDRD=0b11111111;                    //initial PORT D   
        PORTD=0b11111110;   
    }   
//--------------------------------------------------------------------------------------------------------------//   
void    timer0_init(void)   
    {   
        TCNT0=99;                   // 256-99=156; 156*64us=9.984ms @=10ms   
        TCCR0=0x03;   
        TIMSK |= (1<<TOIE0);      // enable timer0 overflow interrupt   
    }   
void    close_timer0(void)   
    {   
        TCCR0=0x00;   
    }   
//--------------------------------------------------------------------------------------------------------------//   
void    timer2_init(void)   
    {   
        TCNT2  = 61;                // 256-61=195; 195*256us=49.92ms per cycle namely ADC's sample rate   
        TCCR2  = 0x06;              // CS22:CS21:CS20=1:1:0 1/256 prescaler   
        TIMSK |= (1<<TOIE2);      // enable timer2 overflow interrupt        
    }   
//--------------------------------------------------------------------------------------------------------------//   
   
