sommer78/HeartRate/Bee1_SDK_1.1.11894.12638/RTL8762/Source/PeripheralSample/hfc100.c
unsigned char eeprom_read_asm(unsigned char eepAddr_asm)   
{   
    cli();   
    asm volatile (  " aa:sbic   0x1C,1  \n\t"   
                    " rjmp  aa          \n\t"   
                    " clr   r25         \n\t"   
                    " out   0x1F,r25    \n\t"   
                    " out   0x1E,r24    \n\t"   
                    " sbi   0x1C,0      \n\t"   
                    " clr   r25         \n\t"   
                    " in    r24,0x1D    \n\t"   
                    : :   
                    );   
    sei();   
}   
//--------------------------------------------------------------------------------------------------------------//   
void eeprom_write_asm(unsigned char eepAddr_asm,unsigned char eepData_asm)   
{   
    cli();   
    asm volatile (  " bb:sbic   0x1C,1  \n\t"   
                    " rjmp  bb          \n\t"   
                    " clr   r25         \n\t"   
                    " out   0x1F,r25    \n\t"   
                    " out   0x1E,r24    \n\t"   
                    " out   0x1D,r22    \n\t"   
                    " sbi   0x1C,2      \n\t"   
                    " sbi   0x1C,1      \n\t"   
                    : :   
                    );   
    sei();   
}   
//--------------------------------------------------------------------------------------------------------------//   
//--------------------------------------------------------------------------------------------------------------//   
uint16_t ReadADC(unsigned char AD_CHANNEL)   
{   
    uint16_t adResult;   
    ADMUX  = AD_CHANNEL;            // ADCn   
    ADCSRA = ADCSRA_INIT;           // division factor between the system clock frequency and the input clock to the ADC,clk/8   
    ADCSRA |= (1<<ADEN);          // ADC enable   
    ADCSRA |= (1<<ADSC);          // ADC start conversion   
    while(!(ADCSRA & (1<<ADIF))); // wait for conversion done, ADIF flag active .   
    ADCSRA |= (0<<ADIF);          // clear ADIF   
    ADCSRA |= (0<<ADEN);          // ADC disable   
    adResult = ADCL;                // ADCL as low byte of adResult   
    adResult += (ADCH << 8);      // ADCH multi 8 times as high byte of adResult   
    return (adResult);   
}   
//--------------------------------------------------------------------------------------------------------------//   
void Filter(uint16_t sample_result)   
{   
    sample_result_before=sample_result_after;   
    sample_result_after=sample_result;   
    if(sample_result_before<sample_result_after)   
    {      
        max=sample_result;   
        if((max-min)>500)    heart_rate_ref=(max/2);   
        else heart_rate_ref=0x03ff;   
    }      
    if(sample_result_before>sample_result_after)     min=sample_result_after;   
    if((sample_result_before<sample_result_after)&&(sample_result>=heart_rate_ref))   up=1;   // symbol of rise up   
    else if((sample_result_before>sample_result_after)&&(sample_result<100))          down=1; // symbol of flow down    
    if ((up==0)&&(down==1))     down=0;    
    if ((up==1)&&(down==1))         // strain the wave by software    
    {   
        heart_rate++;                   // beaten times increase   
        power_off_counter=0;   
        LED1=on;   
        up=0;                           // clear the rise symbol    
        down=0;                         // clear the down symbol           
    }   
}   
//--------------------------------------------------------------------------------------------------------------//   
void level(unsigned int value)   
    {   
        unsigned char level_hundred,level_ten,level_one;   
        level_hundred=(value/100);   
        heart_rate_high=(level_hundred*100);   
        if(level_hundred==1)    voice(voice_100);   
        else if(level_hundred==2) voice(voice_200);   
        level_ten=(value%100);   
        heart_rate_low=level_ten;   
        if(level_ten<=20)   
        {   
            if(level_ten==1)        voice(voice_1);   
            else if(level_ten==2)   voice(voice_2);   
            else if(level_ten==3)   voice(voice_3);   
            else if(level_ten==4)   voice(voice_4);   
            else if(level_ten==5)   voice(voice_5);   
            else if(level_ten==6)   voice(voice_6);   
            else if(level_ten==7)   voice(voice_7);   
            else if(level_ten==8)   voice(voice_8);   
            else if(level_ten==9)   voice(voice_9);   
            else if(level_ten==10)  voice(voice_10);   
            else if(level_ten==11)  voice(voice_11);   
            else if(level_ten==12)  voice(voice_12);   
            else if(level_ten==13)  voice(voice_13);   
            else if(level_ten==14)  voice(voice_14);   
            else if(level_ten==15)  voice(voice_15);   
            else if(level_ten==16)  voice(voice_16);   
            else if(level_ten==17)  voice(voice_17);   
            else if(level_ten==18)  voice(voice_18);   
            else if(level_ten==19)  voice(voice_19);   
            else if(level_ten==20)  voice(voice_20);           
        }   
        else   
        {   
            level_ten=(heart_rate_low/10);   
            if(level_ten==2)        voice(voice_20);   
            else if(level_ten==3)   voice(voice_30);   
            else if(level_ten==4)   voice(voice_40);   
            else if(level_ten==5)   voice(voice_50);   
            else if(level_ten==6)   voice(voice_60);   
            else if(level_ten==7)   voice(voice_70);   
            else if(level_ten==8)   voice(voice_80);   
            else if(level_ten==9)   voice(voice_90);   
            level_one=(heart_rate_low%10);   
            if(level_one==1)        voice(voice_1);   
            else if(level_one==2)   voice(voice_2);   
            else if(level_one==3)   voice(voice_3);   
            else if(level_one==4)   voice(voice_4);   
            else if(level_one==5)   voice(voice_5);   
            else if(level_one==6)   voice(voice_6);   
            else if(level_one==7)   voice(voice_7);   
            else if(level_one==8)   voice(voice_8);   
            else if(level_one==9)   voice(voice_9);   
        }   
           
