sommer78/HeartRate/Bee1_SDK_1.1.11894.12638/RTL8762/Source/PeripheralSample/hfc100.c
    }   
unsigned int heart_rate_cal(void)   
    {   
        unsigned int heart_rate_total;   
        if((interval_times==6000)||(interval_times==2400))   
        {   
            heart_rate_total=heart_rate;// test time=60s   
        }   
        else if(interval_times==1200)   // test time=30s   
        {   
            heart_rate_total=(heart_rate*2);   
        }   
        else if(interval_times==900)    // test time=20s   
        {   
            heart_rate_total=(heart_rate*3);   
        }   
        else if(interval_times==600)    // test time=15s   
        {   
            heart_rate_total=(heart_rate*4);   
        }   
        else if(interval_times==400)    // test time=10s   
        {   
            heart_rate_total=(heart_rate*6);   
        }   
        return (heart_rate_total);   
    }   
//--------------------------------------------------------------------------------------------------------------//   

//--------------------------------------------------------------------------------------------------------------//   
SIGNAL(SIG_OVERFLOW0)                               //timer0 overflow interrupt serve program   
    {   
        TCNT0 = 99;                                 // 256-99=156; 156*64us=9.984ms @=10ms   
        ad_temp=ReadADC(AD_Heart_rate_wave);        // sample heart_rate   
        Filter(ad_temp);                            // get the max value from sample datas         
    }   
//--------------------------------------------------------------------------------------------------------------//   
SIGNAL(SIG_OVERFLOW2)                               //timer2 overflow interrupt serve program   
    {      
        TCNT2 = 61;   
        x_seconds_counter++;                        //empty   
        power_off_counter++;   
        overflow_times++;      
        if(x_seconds_counter>=x_seconds)             // 200*50ms=10,000ms=10s   
        {   
            counter=heart_rate_cal();   
            counter_before = counter_after;   
            counter_after  = counter;   
            x_seconds_counter=0;   
            x_seconds_test=end;   
        }                       // overflow_times increase by one means we get a 50ms interval   
        else if(overflow_times>=(interval_times-x_seconds))   
        {          
            x_seconds_test=start;   
            overflow_times=0;   
        }      
    }   
//--------------------------------------------------------------------------------------------------------------//   
SIGNAL(_VECTOR(0))              //BOD reset   
    {   
        eeprom_write_asm(&eep_heart_rate_high,heart_rate_high);   
        eeprom_write_asm(&eep_heart_rate_low,heart_rate_low);   
        temp22=interval_times/100;   
        eeprom_write_asm(&eep_interval_times,temp22);   
        temp33=x_seconds/100;   
        eeprom_write_asm(&eep_x_seconds,temp33);   
    }          
//--------------------------------------------------------------------------------------------------------------//   
int     main(void)                                  // main function start   
    {   
        while(1)   
        {   
            port_init();                            // ATmega16L's I/O port initialization.   
            M1=0;   
            M0=1;   
            SBT=0;   
            while(power_on_off==off)   
            {   
                if(STAT==1) LED1=on;            //LED1=on;    
                else LED1=off;   
                temp00=0;   
                while(INSTANT==0)   
                {   
                    //LED1=on;   
                    delay(50);                      // delay 50ms   
                    temp00++;   
                    if(temp00>=40)               // wait 2 seconds then turn on the unit.   
                    {   
                        power_on_off    =   on;   
                        POWER_CTRL      =   on;   
                        break;                     
                    }   
                }   
            }   
            LED1=off;   
            power_down=off;                         // clear power_down sleep mode   
            OSCCAL = pgm_read_byte(0X3FFE);   
            IR_EMITER = on;                         // close IR sensor   
            temp00= eeprom_read_asm(&eep_heart_rate_high);   
            temp11= eeprom_read_asm(&eep_heart_rate_low);   
            temp22= eeprom_read_asm(&eep_interval_times);   
            temp33= eeprom_read_asm(&eep_x_seconds);               
            if((temp00==0x00)&&(temp11==0x00)&&(temp22==0x00)&&(temp33==0x00))   
            {   
                eeprom_write_asm(&eep_heart_rate_high,0);   
                eeprom_write_asm(&eep_heart_rate_low,30);   
                eeprom_write_asm(&eep_interval_times,default_interval_times);   
                eeprom_write_asm(&eep_x_seconds,2);    
            }   
            heart_rate_high =eeprom_read_asm(&eep_heart_rate_high);   
            heart_rate_low  =eeprom_read_asm(&eep_heart_rate_low);   
            interval_times  =eeprom_read_asm(&eep_interval_times)*100;   
            x_seconds       =eeprom_read_asm(&eep_x_seconds)*100;   
            counter_after   =heart_rate_high+heart_rate_low;   
            voice(voice_hello);   
            for(i=0;i<10;i++)   
            {   
                LED1=on;   
                delay(100);   
                LED1=off;   
                delay(100);   
            }   
            voice(voice_time_period);   
            if(interval_times==6000)       
            {   
                voice(voice_5);   
                voice(voice_minutes);   
            }   
            else if(interval_times==2400)   
            {   
                voice(voice_2);   
                voice(voice_minutes);   
            }   
            else if(interval_times==1200)   
            {   
                voice(voice_1);   
                voice(voice_minute);   
            }   
            else if(interval_times==900)   
            {   
                voice(voice_40);   
                voice(voice_5);   
                voice(voice_seconds);   
            }   
            else if(interval_times==600)   
            {   
                voice(voice_30);   
                voice(voice_seconds);   
            }   
            else if(interval_times==400)   
            {   
                voice(voice_20);   
                voice(voice_seconds);   
            }   
            sei();   
            timer0_init();                          // timer0 initialization   
            timer2_init();                          // timer2 initialization   
            x_seconds_counter=0;   
            heart_rate=0;   
            power_off_counter=0;       
            while(power_down==off)   
            {   
                IR_EMITER = on;                         // ** open IR sensor       
                if(x_seconds_test==start)   
                {   
                    if(power_off_counter>=200)   
                    {   
                        power_off_counter=0;   
                        power_down=on;   
                        break;   
                    }   
                    delay(50);   
                    LED1 = off;   
                    if(power_down==on)break;   
                    set_sleep_mode(SLEEP_MODE_IDLE);    // set sleep mode --IDLE mode   
                    MCUCR |= (1<<SE);                 // Idle sleep mode selection && sleep enable   
                    sleep_mode();   
                    MCUCR |= (0<<SE);                 // sleep mode disable   
                    scankey();   
                    overflow_times=0;   
                }   
                else   
                {   
                    close_timer0();   
                    if(system_set==0)   
                    {   
                        if(counter_before>=counter_after)   
                        {   
                            if((counter_after>=40) && (counter_after<=290) && (counter_before-counter_after<90))   
                            {   
                                level(counter_after);   
                            }                                  
                        }   
                        else   
                        {   
                            if((counter_after>=40) && (counter_after<=290) && (counter_after-counter_before<90))   
                            {   
                                level(counter_after);   
                            }   
                        }   
                    }   
                    system_set=0;   
                    overflow_times=0;               // start count rest/pause time--not detect heart beat.   
                    timer2_init();   
                    while(x_seconds_test==end)   
                    {   
                        if((interval_times-x_seconds-overflow_times)<=200)   
                        {   
                            IR_EMITER = on;                         // ** open IR sensor   
                        }   
                        else    IR_EMITER = off;                        // ** close IR sensor   
                        x_seconds_counter=0;   
                        power_off_counter=0;   
                        if(x_seconds_test==start)break;   
                        scankey();   
                        if(power_down==on)break;   
                        set_sleep_mode(SLEEP_MODE_IDLE);    // set sleep mode --IDLE mode   
                        MCUCR |= (1<<SE);                 // Idle sleep mode selection && sleep enable   
                        sleep_mode();   
                        MCUCR |= (0<<SE);                 // sleep mode disable   
                    }   
                    if(power_down==on)break;   
                    x_seconds_counter=0;   
                    power_off_counter=0;   
                    heart_rate=0;   
                    timer0_init();                          // timer0 initialization   
                    timer2_init();                          // timer2 initialization                           
                }              
            }   
            close_timer0();   
            TCCR2=0;   
            IR_EMITER = off;                            // ** close IR sensor   
            eeprom_write_asm(&eep_heart_rate_high,heart_rate_high);   
            eeprom_write_asm(&eep_heart_rate_low,heart_rate_low);              
            temp22=interval_times/100;   
            eeprom_write_asm(&eep_interval_times,temp22);   
            temp33=x_seconds/100;   
            eeprom_write_asm(&eep_x_seconds,temp33);       
            LED1=on;   
            delay(1000);   
            voice(voice_goodbye);   
            power_on_off=off;   
            x_seconds_counter=0;   
            power_off_counter=0;   
            POWER_CTRL=off;                             // now it's safe to power off the unit.   
            while(INSTANT==0);   
        }   
    }  